/*
	百钱买百鸡(三种鸡都有)
	公鸡3元/只,母鸡2元/只,小鸡 1元/两只.
	思路:
		公鸡	母鸡	小鸡
		1		1		98
		1		2		97
		... ...
		1		49		50
		----------------------第一轮
		2		1		97
		2		2		96
		... ...
		2		49		49
		----------------------第二轮
		----------------------共33轮
*/
class ForDemo15
{
	public static void main(String[] args) 
	{
		int i,j,k;//i代表公鸡的数量,j代表母鸡的数量,k代表小鸡的数量
		for(i = 1;i <= 33;i++){
			for(j = 1;j <= 49;j++){
				k = 100 - i -j;
				if(k%2 == 0 && (3*i + 2*j + k/2)==100){
					System.out.println("公鸡的数量是:"+i+",母鸡的数量是:"+j+"小鸡的数量是:"+k);
				}
			}
		}
	}
}
