/*
	搬砖问题：36块砖，36人搬，男搬4，女搬3，
	两个小孩抬1砖，要求一次全搬完，
	问男、女和小孩各若干（要求三种都要有）
	男		女		小孩
	1		1		34
	1		2		33
	... ...
	1		11		24
	------------------第一轮
	2		1		33
	2		2		32
	... ...
	2		11		23
	------------------第二轮
	------------------共8轮
*/
class Homework6
{
	public static void main(String[] args){
		int i,j,k;//i代表男人的数量,j代表女人的数量,k代表小孩的数量
		for(i = 1;i <= 8;i++){
			for(j = 1;j <= 11;j++){
				k = 36 - i - j;
				if(k%2 == 0 && (4*i + 3*j + k/2) == 36){
					System.out.println("男人的数量是:"+i+",女人的数量是:"+j+",小孩的数量是:"+k);
				}
			}
		}	
	}
}